Revit 2024 API
ViewSection.IsViewFamilyTypeValidForCallout Method
 This validator checks that the ViewFamilyType is appropriate for callout views in the input parent view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool IsViewFamilyTypeValidForCallout(
	Document document,
	ElementId viewFamilyTypeId,
	ElementId parentViewId
)
Visual Basic
Public Shared Function IsViewFamilyTypeValidForCallout ( _
	document As Document, _
	viewFamilyTypeId As ElementId, _
	parentViewId As ElementId _
) As Boolean
Visual C++
public:
static bool IsViewFamilyTypeValidForCallout(
	Document^ document,
	ElementId^ viewFamilyTypeId,
	ElementId^ parentViewId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document which contains the ViewFamilyType and parent view.
viewFamilyTypeId
Type: Autodesk.Revit.DB.ElementId
 The id of the ViewFamilyType which will be used by the new callout ViewSection. Detail ViewFamilyTypes can be used in all parent views except for CeilingPlan and Drafting views. FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, and Detail ViewFamilyTypes may be be used in parent views that also use a type with the same ViewFamily enum value. For example, in StructuralPlan views both StructuralPlan and Detail ViewFamilyTypes are allowed.
parentViewId
Type: Autodesk.Revit.DB.ElementId
 The view in which the new callout will appear. Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, and Detail views.
Return Value
 True if the ViewFamilyType can be used for callout views in the parent view, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewSection Class
Autodesk.Revit.DB Namespace